{"sections":{"6ce2c482-8447-4fcf-ad57-f4940505dc8c":{"type":"slideshow","blocks":{"template--14833082302545__6ce2c482-8447-4fcf-ad57-f4940505dc8c-1680702544a22f437b-0":{"type":"image","settings":{"title":"Grow with Tiny Trees","title_size":60,"subheading":"How do I get a bonsai bar class?","link":"","link_text":"","text_align":"vertical-center horizontal-center","image":"shopify:\/\/shop_images\/BonsaiBar_Faction_billings_March2025-41.jpg","parallax_direction":"top","overlay_opacity":0,"focal_point":"center center"}}},"block_order":["template--14833082302545__6ce2c482-8447-4fcf-ad57-f4940505dc8c-1680702544a22f437b-0"],"custom_css":[".parallax-container {position: absolute; top: 0%; left: 0; height: 100%; width: 100%;}"],"settings":{"section_height":"natural","mobile_height":"250px","parallax":true,"style":"arrows","autoplay":true,"autoplay_speed":5}},"main":{"type":"main-page","disabled":true,"settings":{}},"rich_text_3wQTrp":{"type":"rich-text","blocks":{"text_pdEeYG":{"type":"text","settings":{"enlarge_text":true,"text":"<p><strong>Maybe you’ve heard of us—we’re the “Tiny Trees, Big Love” folks. <\/strong>In 2024, we helped over 31,000 people create their own bonsai trees in brewery taprooms and venues across the country. <a href=\"\/pages\/about-us\" target=\"_blank\" title=\"About Us\">We're a small team <\/a>supported by a small number of expert Bonsai Teachers.<\/p><p>We’d love to bring that same magic to your venue! Let’s chat about hosting a bonsai class on a slower evening or weekend to activate your space with something meaningful, memorable, and profitable.<\/p>"}}},"block_order":["text_pdEeYG"],"settings":{"align_text":"center","narrow_column":true,"divider":false}},"rich_text_tm3yMN":{"type":"rich-text","blocks":{"heading_ejNjX4":{"type":"heading","settings":{"title":"The Bonsai Bar Workshop Program"}},"text_bKAwmq":{"type":"text","settings":{"enlarge_text":false,"text":"<p>A two-hour, comprehensive beginner bonsai workshop, where we guide participants through repotting, styling, and caring for their own bonsai tree.<br\/><br\/>Our event isn’t just about the workshop – it’s about showcasing your stunning venue. Tiny Trees thrive in the spotlight, so you can’t tuck us away in a back room or out of sight. With us in the heart of the action, your space will be featured in some of the most photographed and Instagrammed moments of the year. It’s the perfect way to let your venue shine and capture its beauty for all to see!<br\/><br\/>Bonsai Bar has aggressive paid social ad campaigns targeting local audiences to promote events at your venue. These ads help prospective customers find your venue.<\/p><p>Our Co-Marketing Program requires venue locations to <strong>actively<\/strong> advertise the workshops through social media, email newsletters, posters, and any other creative Co-Marketing ideas you can think of! You will have to help market your class.<br\/><br\/>Approximately 50% of attendees are first-time visitors, injecting fresh energy and new first time guests into your space.<br\/><br\/>Our ticket prices vary by state. All ticket sales are handled by Bonsai Bar, while food and drink sales go directly to the venue—we don’t take a cut.<br\/><br\/>Attendees typically purchase 1-3 drinks and food, often extending their visit into dinner or post-class refreshments.<br\/><br\/>For our winery partners, we encourage selling by the glass and bottle during the event. We also recommend sending out a sales associate to promote case sales and club membership incentives before class starts.<br\/><br\/>We bring everything – tools, supplies, and even the magic – and we'll handle the setup and cleanup like pros. But fair warning: your staff might find a little extra layer of 'soil' on the floor at the end of the night, like a tiny forest had a party. It’s all part of the experience, just a few extra roots to sweep up!<\/p>"}}},"block_order":["heading_ejNjX4","text_bKAwmq"],"settings":{"align_text":"center","narrow_column":true,"divider":false}},"051634a5-4e3e-4d7c-82c7-1290c849dcda":{"type":"rich-text","settings":{"align_text":"center","narrow_column":true,"divider":false}},"fading_images_AdBYyV":{"type":"fading-images","blocks":{"image_dLYFNz":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/PARLEAUX-20.jpg","focal_point":"center center","slide_title1":"Happy guests return time and again.","slide_title2":""}},"image_J38kEE":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/BonsaiBar_BrandyD-Teacher.jpg","focal_point":"center center","slide_title1":"Let's fill your venue with joy.","slide_title2":""}},"image_p6V8UJ":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/BonsaiBar-Work-Besties.jpg","focal_point":"top center","slide_title1":"Many of our guests are first time visitors.","slide_title2":""}},"image_TWe8ak":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/PARLEAUX-15_873bf97d-dfd4-461e-9e79-c253aa308059.jpg","focal_point":"center center","slide_title1":"Bonsai guests value experiences, connection and quality.","slide_title2":""}}},"block_order":["image_dLYFNz","image_J38kEE","image_p6V8UJ","image_TWe8ak"],"settings":{"title_lines":"1","title_font":"body","title_size":45,"title_color":"#ffffff","title_bg_color":"rgba(0,0,0,0)","text_align":"vertical-center horizontal-center","link":"","slide_speed":5,"color_overlay":"#000000","color_overlay_opacity":30,"desktop_height":"650px","mobile_height":"auto"}},"faq_dpcync":{"type":"faq","blocks":{"question_yJ977n":{"type":"question","settings":{"title":"Does hosting Bonsai Bar cost any money?","text":"<p><strong>We don’t charge our venues, and they don’t charge us.<\/strong><br\/><br\/>It’s the heart of our co-marketing success—a shared passion for small business and a commitment to grow together.<\/p>"}},"question_6GdGDn":{"type":"question","settings":{"title":"Will you include the price of a beer in your ticket?","text":"<p>Including the cost of a drink in the ticket price complicates pricing and tax calculations, especially since drink prices vary by venue. It also limits flexibility for both the venue and guests. This is why we keep drink costs separate—it's a policy we follow across 150+ venues in 13 states to ensure clarity and simplicity for everyone involved.<\/p>"}},"question_eKXWDF":{"type":"question","settings":{"title":"When is the best time to have a class?","text":"<p>Our classes are Ideal for slightly slower days, as special events to boost foot traffic, or as an engaging addition to bustling evenings, depending on your venue's needs. Most commonly we host workshops Tues - Thursday and Saturday and Sunday Mornings.<\/p>"}},"question_ryr8pq":{"type":"question","settings":{"title":"Do you have printed posters for my venue?","text":"<p>Yes! We're in the process of rolling out new posters as of April 2025. Please reach out to our Marketing team and we'll hook you up. We may need an updated version of your logo. <\/p>"}},"question_tjW6QQ":{"type":"question","settings":{"title":"How big are the classes?","text":"<p>Class sizes must be a minimum of 20 participants, with a comfortable maximum of 40. Each participant requires a seat and 24\" of table space. Guests are not allowed to share trees. If you wish to have a non-participating guest accompany a participant, they must entertain themselves at the bar or another designated area away from the class.<\/p>"}},"question_PYBqnf":{"type":"question","settings":{"title":"Do you let kids in the classes?","text":"<p>Oh man, this is tricky. If your venue prohibits guests under 21, please let your Bonsai Bar staff member know so we can clearly support your rules. Here's how we typically handle this situation: under our <a href=\"\/pages\/faqs\" target=\"_blank\" title=\"FAQ's\">FAQs, you'll see we have a response about tickets for 4-year-olds (discouraged!) and tickets for 17-year-olds (allowed).<\/a><\/p>"}},"question_D736YM":{"type":"question","settings":{"title":"Do you have free tickets for staff?","text":"<p>We have a very generous discount for your staff to particpate in class! As your Regional Director or the Coupon Code.<\/p>"}},"question_KRPTR3":{"type":"question","settings":{"title":"How do I explain the class to my regulars?","text":"<p>Bonsai Bar is a beginner workshop that introduces people to the amazing hobby of bonsai. When you take a class you pick out a tree, your very own pot and the teacher guides you through styling and caring for it. You learn how to care for it and take it home to love forever. If you register your tree it has a tree guarantee and they'll even replace it if you accidentally kill it. Bonsai Bar is incredibly poplar. They're in 12 states and growing all over the country. Last year they made over 31,000 tiny trees with guests in breweries!<\/p>"}},"question_a3n4py":{"type":"question","settings":{"title":"How long is a class?","text":"<p>Classes are typically 120 minutes.<\/p>"}},"question_xKbfcy":{"type":"question","settings":{"title":"How many people come to a class?","text":"<p>Classes typically sell out with 24 - 36 guests. Many are first time guests so be prepared to WOW them so they come back to your venue!<\/p>"}},"question_CGWGdz":{"type":"question","settings":{"title":"Is the class disruptive to my venue?","text":"<p>Bonsai Bar classes bring life, laughter, and a whole lot of good vibes to your venue. The sweet spot to host the class? Right smack in the middle of your taproom, tasting room, or bar. Your patrons will be hooked—watching the bonsai magic unfold and already signing up to join the next class. The energy is contagious (in the best way).<\/p><p>But seriously—<strong>PLEASE<\/strong> cancel your pinball, skee-ball, and axe-throwing night when you host Bonsai Bar. No, we're not kidding. <\/p>"}},"question_HYEr6M":{"type":"question","settings":{"title":"How do I get Bonsai Bar to keep coming back?","text":"<p>Co-marketing is all about working together to create something bigger than the sum of its parts. Our best venues are the ones that really lean in—by including Bonsai Bar in their emails to fans, social media posts, hanging up posters, mentioning us during trivia, or giving us a shout-out to their mug and wine clubs. These venues prioritize Bonsai Bar as part of their very special offering, and they’re the ones who get the regular, scheduled classes.<\/p><p>As for offering our instructor a free beer? We love the hospitality, but it’s not exactly the key to getting a Bonsai Bar class booked regularly. It’s the effort behind the marketing and the prioritization of our experience that truly makes the difference.<\/p><p>Venues down the street that can't seem to get a class scheduled? Well, they’re probably not doing any of the above. It’s all about putting in the effort and working together to make it happen!<\/p>"}},"question_BriARi":{"type":"question","settings":{"title":"Can every venue get a Bonsai Bar class?","text":"<p>We’d love to bring a Bonsai Bar class to every venue that asks—but there are a few reasons we have to be selective. If there’s already a successful Bonsai Bar class in your city or town, we typically won’t schedule a competing event nearby. We want each class to thrive, not split the audience.<\/p><p>Another big challenge is finding the right instructors. Teaching bonsai in a bar isn’t just about knowing trees—it takes someone with real charisma who can command a room, keep the energy up in a lively venue, and still teach the craft with passion and accuracy. Those folks are rare, and we're always on the lookout.<\/p><p>Right now, we’re especially focused on growing in Colorado, Northern California, Florida, and Texas—particularly Austin, Dallas, and San Antonio. So if you happen to know someone with bonsai chops and a big personality in one of those areas, we’d love to meet them!<\/p>"}}},"block_order":["question_yJ977n","question_6GdGDn","question_eKXWDF","question_ryr8pq","question_tjW6QQ","question_PYBqnf","question_D736YM","question_KRPTR3","question_a3n4py","question_xKbfcy","question_CGWGdz","question_HYEr6M","question_BriARi"],"settings":{"title":"FAQs"}}},"order":["6ce2c482-8447-4fcf-ad57-f4940505dc8c","main","rich_text_3wQTrp","rich_text_tm3yMN","051634a5-4e3e-4d7c-82c7-1290c849dcda","fading_images_AdBYyV","faq_dpcync"]}